The duct/pipe has been modified to be in the opposite direction causing the connections to be invalid.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DuctPipeModified { get; }
  Visual Basic
Public Shared ReadOnly Property DuctPipeModified As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DuctPipeModified {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PipingFailures Class
  Autodesk.Revit.DB Namespace